#!/bin/bash
cd /tmp
curl -LO https://raw.githubusercontent.com/poruncov/gentoo-check-update/refs/heads/main/check.zsh
cp check.zsh /etc/zsh/.
chmod +x /etc/zsh/check.zsh
clear
echo '####################################################################'
echo '                                                                   #
Далее для корректной работы необходимо добавить в ваш zshrc строку #
                                                                   #
####################################################################
                                                                   #
        Если глобально для всех пользователей                      #
              ввсести в терминале:                                 #
    sudo echo "source /etc/zsh/check.zsh" >> /etc/zsh/zshrc        #
             или если без sudo, то из под root.                    #
                                                                   #
####################################################################
                                                                   #
          Если для конкретного пользователей                       #
                ввсести в терминале:                               #
    echo "source /etc/zsh/check.zsh" >> ~/.zshrc                   #
                                                                   #
###########№№№######################################################
                                                                   #
   Либо укажите путь самостоятельно в зависимости от того,         #
            как настроено у вас окружение.                         #
                                                                   #
##############№№№№№№№№№#############################################
'
